In [1]:
%load_ext sql

In [2]:
%sql postgresql://admin:welcome1@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM T_SONG_PLAY LIMIT 5;

 * postgresql://admin:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 21, 0, 57, 58), 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 21, 0, 58, 41), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 21, 1, 2, 5), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 21, 1, 3, 13), 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 21, 1, 5, 29), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"')]

In [4]:
%sql SELECT * FROM T_USER LIMIT 5;

 * postgresql://admin:***@127.0.0.1/sparkifydb
5 rows affected.

[(80, 'Tegan', 'Levine', 'F', 'paid'),
 (97, 'Kate', 'Harrell', 'F', 'paid'),
 (40, 'Tucker', 'Garrison', 'M', 'free'),
 (65, 'Amiya', 'Davidson', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [5]:
%sql SELECT * FROM T_SONG LIMIT 5;

 * postgresql://admin:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, 218.77506),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, 269.81832),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, 148.03546),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, 266.39628),
 ('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, 114.78159)]

In [8]:
%sql SELECT * FROM T_ARTIST LIMIT 5;

 * postgresql://admin:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', 35.21962, -80.01955),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', nan, nan),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', 35.14968, -90.04892),
 ('ARNTLGG11E2835DDB9', 'Clp', '', nan, nan),
 ('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', nan, nan)]

In [9]:
%sql SELECT * FROM T_TIME_TABLE LIMIT 5;

 * postgresql://admin:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 21, 0, 57, 58), 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 0, 58, 41), 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 2, 5), 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 3, 13), 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 5, 29), 21, 47, 11, 2018, 2)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [10]:
import os
import glob
import psycopg2
import pandas as pd

from sql_queries import *
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
cur = conn.cursor()
query = "select * from T_SONG_PLAY where song_id is not null;"
cur.execute(query)
count = 0
try:
    row = cur.fetchone()
    while row:
        print(row)
        count+=1
        row = cur.fetchone()
except Exception as e:
    print(e)
print(f'Total records processed : {count}')
cur.close()
conn.close()

(404, datetime.datetime(2018, 11, 21, 21, 56, 47), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')
Total records processed : 1